/* --------------------------------- TASK 1 --------------------------------- */

/* Прокомментируйте свой код JavaScript  */

// This is an in-line comment.

/* This is a
multi-line comment */

/* --------------------------------- TASK 2 --------------------------------- */

/* Объявить переменные JavaScript.
Используйте varключевое слово, чтобы создать переменную с именем myName. */

/* var myName; */

/* --------------------------------- TASK 3 --------------------------------- */

/*  */

/* */
