/* --------------------------------- TASK 1 --------------------------------- */

/* Прокомментируйте свой код JavaScript  */

// This is an in-line comment.

/* This is a
multi-line comment */

/* --------------------------------- TASK 2 --------------------------------- */

/* Объявить переменные JavaScript.
Используйте varключевое слово, чтобы создать переменную с именем myName. */

/* var myName; */

/* --------------------------------- TASK 3 --------------------------------- */

/* Присвоить значение 7 переменной a. */

/* 

var a;
a=7; 

console.log(a);

*/

/* --------------------------------- TASK 4 --------------------------------- */

/* Присвойте содержимое aпеременной b. */

/* 

var a;
a = 7;
var b;
b = a; 

console.log(b);

*/

/* --------------------------------- TASK 5 --------------------------------- */

/* Определите переменную a с помощью var и инициализируйте ее значением 9. */

/* 

var a = 9;

console.log(a);

*/

/* --------------------------------- TASK 6 --------------------------------- */

/* Создайте две новые строковые переменные: myFirstNameи myLastNameи присвойте им значения вашего имени и фамилии соответственно. */

/* var myFirstName = "V";
var myLastName = "B";

console.log(myFirstName);
console.log(myLastName); */

/* --------------------------------- TASK 7 --------------------------------- */

/* Инициализируйте три переменные a, b, и cс 5, 10, и "I am a"соответственно так, чтобы их не было undefined. */

/* var a = 5;
var b = 10;
var c = "I am a";

a = a + 1;
b = b + 5;
c = c + " String!";

console.log(a);
console.log(b);
console.log(c); */

/* --------------------------------- TASK 8 --------------------------------- */

/* Измените существующие объявления и назначения, чтобы в их именах использовался camelCase .

Не создавайте никаких новых переменных. */

/* 
var studlyCapVar ;
var properCamelCase;
var titleCaseOver ;


studlyCapVar  = 10;
properCamelCase = "A String";
titleCaseOver  = 9000;

console.log(studlyCapVar);
console.log(properCamelCase);
console.log(titleCaseOver); */

/* --------------------------------- TASK 9 --------------------------------- */

/* Обновите код, чтобы он использовал только letключевое слово. */

/* 
let catName = "Oliver";
let catSound = "Meow!";

console.log(catName);
console.log(catSound);
*/

/* --------------------------------- TASK 10 --------------------------------- */

/* Измените код так, чтобы все переменные объявлялись с помощью letили const. Используйте let, когда вы хотите, 
чтобы переменная изменялась, и constкогда вы хотите, чтобы переменная оставалась постоянной. Кроме того, переименуйте переменные, 
объявленные с помощью const, чтобы они соответствовали общепринятым практикам. Не изменяйте строки, назначенные переменным. */

/* 
let fCC = "freeCodeCamp"; 
const fact = "is cool!"; 
fact = "is awesome!";

console.log(fCC, fact);
*/

/* --------------------------------- TASK 11 --------------------------------- */

/* Измените код так, чтобы все переменные объявлялись с помощью letили const. Используйте let, когда вы хотите, 
чтобы переменная изменялась, и constкогда вы хотите, чтобы переменная оставалась постоянной. Кроме того, переименуйте переменные, 
объявленные с помощью const, чтобы они соответствовали общепринятым практикам. Не изменяйте строки, назначенные переменным. */

/* 
const FCC = "freeCodeCamp"; 
let fact = "is cool!"; 
fact = "is awesome!";
console.log(FCC, fact); 
*/
