"use strict";

/* --------------------------------- TASK 87 --------------------------------- */

/* Создайте объект, представляющий вызываемую собаку myDog, который содержит свойства name(строку) legs, tailsи friends.
Вы можете установить для этих свойств объекта любые значения, которые вы хотите, если nameэто строка, legsчисла tailsи friendsмассив. 

Ожидание :myDogдолжен содержать свойство name, и это должен быть файл string.
Ожидание :myDogдолжен содержать свойство legs, и это должен быть файл number.
Ожидание :myDogдолжен содержать свойство tails, и это должен быть файл number.
Ожидание :myDogдолжен содержать свойство friendsи должен быть array.
Ожидание :myDogдолжен содержать только все заданные свойства.
*/

/* const myDog = {

name: "Dog",
legs: 5,
tails: 2,
friends: ["Dog1", "Dog2"]
};

console.log(myDog); */

/* --------------------------------- TASK 88 --------------------------------- */

/*  */

/*  */

/* --------------------------------- TASK 89 --------------------------------- */

/*  */

/*  */

/* --------------------------------- TASK 90 --------------------------------- */

/*  */

/*  */
