"use strict";

/* --------------------------------- TASK 1 --------------------------------- */

/* Прокомментируйте свой код JavaScript  */

// This is an in-line comment.

/* This is a
multi-line comment */

/* --------------------------------- TASK 2 --------------------------------- */

/* Объявить переменные JavaScript.
Используйте varключевое слово, чтобы создать переменную с именем myName. */

/* var myName; */

/* --------------------------------- TASK 3 --------------------------------- */

/* Присвоить значение 7 переменной a. */

/* 

var a;
a=7; 

console.log(a);

*/

/* --------------------------------- TASK 4 --------------------------------- */

/* Присвойте содержимое aпеременной b. */

/* 

var a;
a = 7;
var b;
b = a; 

console.log(b);

*/

/* --------------------------------- TASK 5 --------------------------------- */

/* Определите переменную a с помощью var и инициализируйте ее значением 9. */

/* 

var a = 9;

console.log(a);

*/

/* --------------------------------- TASK 6 --------------------------------- */

/* Создайте две новые строковые переменные: myFirstNameи myLastNameи присвойте им значения вашего имени и фамилии соответственно. */

/* var myFirstName = "V";
var myLastName = "B";

console.log(myFirstName);
console.log(myLastName); */

/* --------------------------------- TASK 7 --------------------------------- */

/* Инициализируйте три переменные a, b, и cс 5, 10, и "I am a"соответственно так, чтобы их не было undefined. */

/* var a = 5;
var b = 10;
var c = "I am a";

a = a + 1;
b = b + 5;
c = c + " String!";

console.log(a);
console.log(b);
console.log(c); */

/* --------------------------------- TASK 8 --------------------------------- */

/* Измените существующие объявления и назначения, чтобы в их именах использовался camelCase .

Не создавайте никаких новых переменных. */

/* 
var studlyCapVar ;
var properCamelCase;
var titleCaseOver ;


studlyCapVar  = 10;
properCamelCase = "A String";
titleCaseOver  = 9000;

console.log(studlyCapVar);
console.log(properCamelCase);
console.log(titleCaseOver); */

/* --------------------------------- TASK 9 --------------------------------- */

/* Обновите код, чтобы он использовал только letключевое слово. */

/* 
let catName = "Oliver";
let catSound = "Meow!";

console.log(catName);
console.log(catSound);
*/

/* --------------------------------- TASK 10 --------------------------------- */

/* Измените код так, чтобы все переменные объявлялись с помощью letили const. Используйте let, когда вы хотите, 
чтобы переменная изменялась, и constкогда вы хотите, чтобы переменная оставалась постоянной. Кроме того, переименуйте переменные, 
объявленные с помощью const, чтобы они соответствовали общепринятым практикам. Не изменяйте строки, назначенные переменным. */

/* 
let fCC = "freeCodeCamp"; 
const fact = "is cool!"; 
fact = "is awesome!";

console.log(fCC, fact);
*/

/* --------------------------------- TASK 11 --------------------------------- */

/* Измените код так, чтобы все переменные объявлялись с помощью letили const. Используйте let, когда вы хотите, 
чтобы переменная изменялась, и constкогда вы хотите, чтобы переменная оставалась постоянной. Кроме того, переименуйте переменные, 
объявленные с помощью const, чтобы они соответствовали общепринятым практикам. Не изменяйте строки, назначенные переменным. */

/* 
const FCC = "freeCodeCamp"; 
let fact = "is cool!"; 
fact = "is awesome!";
console.log(FCC, fact); 
*/

/* --------------------------------- TASK 12 --------------------------------- */

/* Измените 0так, чтобы сумма была равна 20. */

/* 
const sum = 10 + 10;

console.log(sum); 
*/

/* --------------------------------- TASK 13 --------------------------------- */

/* Измените 0так что разница 12. */

/* 
const difference = 45 - 33;

console.log(difference); 
*/

/* --------------------------------- TASK 14 --------------------------------- */

/* Измените 0так, чтобы произведение было равно 80. */

/* 
const product = 8 * 10;

console.log(product); 
*/

/* --------------------------------- TASK 15 --------------------------------- */

/* Измените 0так, чтобы значение quotientбыло равно 2. */

/* 
const quotient = 66 / 33;

console.log(quotient); 
*/

/* --------------------------------- TASK 16 --------------------------------- */

/* Измените код, чтобы использовать ++ оператор на myVar. */

/* 
let myVar = 87;

myVar++;

console.log(myVar); 
*/

/* --------------------------------- TASK 17 --------------------------------- */

/* Измените код, чтобы использовать -- оператор на myVar. */

/* 
let myVar = 11;

myVar--;

console.log(myVar); 
*/

/* --------------------------------- TASK 18 --------------------------------- */

/* Создайте переменную myDecimalи присвойте ей десятичное значение с дробной частью (например, 5.7). */

/* 
const myDecimal = 5.7;

console.log(myDecimal); 
*/

/* --------------------------------- TASK 19 --------------------------------- */

/* Измените 0.0 так, чтобы произведение было равно 5.0. */

/* 
const product = 2.0 * 2.5;

console.log(product); 
*/

/* --------------------------------- TASK 20 --------------------------------- */

/* Измените 0.0 так, чтобы произведение было равно 5.0. */

/* 
const product = 2.0 * 2.5;

console.log(product); 
*/

/* --------------------------------- TASK 21 --------------------------------- */

/* Измените 0.0 так, чтобы он quotientбыл равен 2.2. */

/* 
const quotient = 4.4 / 2.0;

console.log(quotient); 
*/

/* --------------------------------- TASK 22 --------------------------------- */

/* Измените 0.0 так, чтобы он quotientбыл равен 2.2. */

/* 
const quotient = 4.4 / 2.0;

console.log(quotient); 
*/

/* --------------------------------- TASK 23 --------------------------------- */

/* Установите remainderравным остатку от 11деления с 3помощью оператора остатка (%). */

/* 
const remainder = 11 % 3;

console.log(remainder); 
*/

/* --------------------------------- TASK 24 --------------------------------- */

/* Преобразуйте назначения для a, bи cс помощью += оператора. */

/* 
let a = 3;
let b = 17;
let c = 12;

// Only change code below this line
a += 12;
b += 9;
c += 7;

console.log(a, b, c); 
*/

/* --------------------------------- TASK 25 --------------------------------- */

/* Преобразуйте назначения для a, bи cс помощью -= оператора. */

/* 
let a = 11;
let b = 9;
let c = 3;

// Only change code below this line
a -= 6;
b -= 15;
c -= 1; 

console.log(a, b, c); 
*/

/* --------------------------------- TASK 26 --------------------------------- */

/* Преобразуйте назначения для a, bи cс помощью *= оператора. */

/* 
let a = 5;
let b = 12;
let c = 4.6;

// Only change code below this line
a *= 5;
b *= 3;
c *= 10;

console.log(a, b, c); 
*/

/* --------------------------------- TASK 27 --------------------------------- */

/* Преобразуйте назначения для a, bи cс помощью /= оператора. */

/* 
let a = 48;
let b = 108;
let c = 33;

// Only change code below this line
a /= 12;
b /= 4;
c /= 11;

console.log(a, b, c); 
*/
